import React, { useState, useEffect } from 'react';
import axios from 'axios';
import './news_list.css'

function NewsList(props) {

    const [newsData, setNewsData] = useState([]);

    useEffect(() => {
        axios.get('http://94.103.85.179:5000/api/news/1')
            .then(response => {
                setNewsData(response.data);
            })
            .catch(error => {
                console.error('Ошибка при получении данных:', error);
            });
    }, []);
    
    return (
        <div>
            <div className="black_line"></div>
            <div className="news_list_body">
                <div className="top_text">Последние темы</div>
                <div className="news_canteiner">
                    {newsData.map(news => (
                        <div className="news_body" key={news.id_Статьи}>
                            <div className="news_text">
                                <div className="news_name">{news.Название}</div>
                                <div className="news_description">{news.Описание_статьи}</div>
                                <div className="news_info">
                                    <div className="news_views">
                                        <div className="views_icon">
                                            <svg width="15" height="15" viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M14.4908 7.31016C14.4703 7.26387 13.974 6.16289 12.8707 5.05957C11.4006 3.58945 9.54374 2.8125 7.49999 2.8125C5.45624 2.8125 3.59941 3.58945 2.12929 5.05957C1.02597 6.16289 0.527338 7.26563 0.509174 7.31016C0.482522 7.3701 0.46875 7.43498 0.46875 7.50059C0.46875 7.56619 0.482522 7.63107 0.509174 7.69102C0.529682 7.7373 1.02597 8.8377 2.12929 9.94102C3.59941 11.4105 5.45624 12.1875 7.49999 12.1875C9.54374 12.1875 11.4006 11.4105 12.8707 9.94102C13.974 8.8377 14.4703 7.7373 14.4908 7.69102C14.5175 7.63107 14.5312 7.56619 14.5312 7.50059C14.5312 7.43498 14.5175 7.3701 14.4908 7.31016ZM7.49999 11.25C5.69648 11.25 4.12089 10.5943 2.8166 9.30176C2.28143 8.76955 1.82612 8.16267 1.46484 7.5C1.82602 6.83727 2.28134 6.23038 2.8166 5.69824C4.12089 4.40566 5.69648 3.75 7.49999 3.75C9.30351 3.75 10.8791 4.40566 12.1834 5.69824C12.7196 6.23025 13.1759 6.83714 13.5381 7.5C13.1156 8.28867 11.2752 11.25 7.49999 11.25ZM7.49999 4.6875C6.94373 4.6875 6.39997 4.85245 5.93745 5.16149C5.47494 5.47053 5.11445 5.90979 4.90158 6.4237C4.68871 6.93762 4.63301 7.50312 4.74154 8.04869C4.85006 8.59426 5.11792 9.0954 5.51126 9.48874C5.90459 9.88207 6.40573 10.1499 6.9513 10.2585C7.49687 10.367 8.06237 10.3113 8.57629 10.0984C9.09021 9.88554 9.52946 9.52505 9.8385 9.06254C10.1475 8.60003 10.3125 8.05626 10.3125 7.5C10.3117 6.75432 10.0152 6.0394 9.48788 5.51212C8.9606 4.98484 8.24568 4.68828 7.49999 4.6875ZM7.49999 9.375C7.12915 9.375 6.76664 9.26503 6.4583 9.05901C6.14996 8.85298 5.90963 8.56014 5.76772 8.21753C5.62581 7.87492 5.58867 7.49792 5.66102 7.13421C5.73337 6.77049 5.91195 6.4364 6.17417 6.17417C6.43639 5.91195 6.77049 5.73337 7.1342 5.66103C7.49791 5.58868 7.87491 5.62581 8.21753 5.76773C8.56014 5.90964 8.85297 6.14996 9.059 6.45831C9.26503 6.76665 9.37499 7.12916 9.37499 7.5C9.37499 7.99728 9.17745 8.47419 8.82582 8.82582C8.47419 9.17746 7.99728 9.375 7.49999 9.375Z" fill="white"/>
                                            </svg>

                                        </div>
                                        <div className="views_num">{news.Просмотров}</div>
                                    </div>
                                    <div className="news_likes">
                                        <div className="likes_icon">
                                        <svg width="15" height="15" viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <g clip-path="url(#clip0_115_231)">
                                        <path d="M4.6875 2.5C2.78906 2.5 1.25 4.03906 1.25 5.9375C1.25 9.375 5.3125 12.5 7.5 13.2269C9.6875 12.5 13.75 9.375 13.75 5.9375C13.75 4.03906 12.2109 2.5 10.3125 2.5C9.15 2.5 8.12188 3.07719 7.5 3.96063C7.18303 3.50913 6.76193 3.14065 6.27235 2.8864C5.78278 2.63215 5.23916 2.49961 4.6875 2.5Z" stroke="white" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
                                        </g>
                                        <defs>
                                        <clipPath id="clip0_115_231">
                                        <rect width="15" height="15" fill="white"/>
                                        </clipPath>
                                        </defs>
                                        </svg>
                                        </div>
                                        <div className="likes_num">{news.Лайков}</div>
                                    </div>
                                    <div className="news_comments">
                                        <div className="comments_icon">
                                            <svg width="15" height="15" viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M4.375 7.5H4.12875C3.88183 7.49994 3.64043 7.57302 3.435 7.71L1.875 8.75V3.125C1.875 2.79348 2.0067 2.47554 2.24112 2.24112C2.47554 2.0067 2.79348 1.875 3.125 1.875H7.5C7.83152 1.875 8.14946 2.0067 8.38388 2.24112C8.6183 2.47554 8.75 2.79348 8.75 3.125V4.375M7.5 6.25H11.875C12.2065 6.25 12.5245 6.3817 12.7589 6.61612C12.9933 6.85054 13.125 7.16848 13.125 7.5V13.125L11.565 12.085C11.3596 11.948 11.1182 11.8749 10.8712 11.875H7.5C7.16848 11.875 6.85054 11.7433 6.61612 11.5089C6.3817 11.2745 6.25 10.9565 6.25 10.625V7.5C6.25 7.16848 6.3817 6.85054 6.61612 6.61612C6.85054 6.3817 7.16848 6.25 7.5 6.25Z" stroke="white" stroke-linecap="round" stroke-linejoin="round"/>
                                            </svg>
                                        </div>
                                        <div className="comments_num">{news.Коментариев}</div>
                                    </div>
                                </div>
                            </div>
                        </div>
                    ))}
                </div>
            </div>
        </div>
    );
}

export default NewsList;